### Pandas-DataFrame and Series
Pandas is a powerful data manipulation library in Python,widely used for data analysis and data cleaning. It provides two primary data structures:Series and DataFrames.A series is one dimensional array-like object, while Data Frame is a Two-dimesional, size-mutable , and potentially heterogeneous tabular data structure with labeled axes(rows and columns)

In [ ]:
pip install pandas

In [2]:
import pandas as pd

In [4]:
## Series - similar to column in table.
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
## Create a series from dictionary
data = {'a':1,'b':2,'c':3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [7]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [10]:
## Data Frame
## Multiple rows and coloumn

## create a dataframe form a dictionary of list
data = {
        'Name' : ['Nobita','Shizuka','Doremon','Gian','Suneo'],
        'Age' : [20,19,300,22,21],
        'City' : ['Japan','Japan','Tokyo','Hawai','Hawai']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age   City
0   Nobita   20  Japan
1  Shizuka   19  Japan
2  Doremon  300  Tokyo
3     Gian   22  Hawai
4    Suneo   21  Hawai
<class 'pandas.core.frame.DataFrame'>

In [40]:
## Create a dataFrame from list of dictionaries.

data = [
    {'Name' : 'Anshika','Age' : 18, 'City' : "Dewas"},
    {'Name' : 'Bhumika','Age' : 18, 'City' : "Indore"},
    {'Name' : 'Sumit','Age' : 20, 'City' : "Dewas"},
    {'Name' : 'Adeesh','Age' : 18, 'City' : "Indore"},
    {'Name' : 'Bhavesh','Age' : 19, 'City' : "Indore"}
]
Data= pd.DataFrame(data)
print(Data)

      Name  Age    City
0  Anshika   18   Dewas
1  Bhumika   18  Indore
2    Sumit   20   Dewas
3   Adeesh   18  Indore
4  Bhavesh   19  Indore

In [20]:
df = pd.read_csv("sale_data.csv")
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [22]:
## Accessing data from Dataframe

df['Description']

0          WHITE HANGING HEART T-LIGHT HOLDER
1                         WHITE METAL LANTERN
2              CREAM CUPID HEARTS COAT HANGER
3         KNITTED UNION FLAG HOT WATER BOTTLE
4              RED WOOLLY HOTTIE WHITE HEART.
                         ...
541904            PACK OF 20 SPACEBOY NAPKINS
541905           CHILDREN'S APRON DOLLY GIRL
541906          CHILDRENS CUTLERY DOLLY GIRL
541907        CHILDRENS CUTLERY CIRCUS PARADE
541908          BAKING SET 9 PIECE RETROSPOT
Name: Description, Length: 541909, dtype: object

In [ ]:
df.loc[0][0] # row index

C:\Users\anshi\AppData\Local\Temp\ipykernel_13412\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'536365'

In [ ]:
df.iloc[0][2]# Index location

C:\Users\anshi\AppData\Local\Temp\ipykernel_13412\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'WHITE HANGING HEART T-LIGHT HOLDER'

In [26]:
df.iloc[0]

InvoiceNo                                  536365
StockCode                                  85123A
Description    WHITE HANGING HEART T-LIGHT HOLDER
Quantity                                        6
InvoiceDate                        12/1/2010 8:26
UnitPrice                                    2.55
CustomerID                                17850.0
Country                            United Kingdom
Name: 0, dtype: object

In [27]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [ ]:
## Accessing a specified element using 'at'
df.at[2,'UnitPrice']

2.75

In [32]:
## Accessing a specified element using 'iat'
df.iat[4,4]

'12/1/2010 8:26'

In [42]:
## adding a coloumn
Data['Gender'] = ['Female','Female','Male','Male','Male']
Data

      Name  Age    City  Gender
0  Anshika   18   Dewas  Female
1  Bhumika   18  Indore  Female
2    Sumit   20   Dewas    Male
3   Adeesh   18  Indore    Male
4  Bhavesh   19  Indore    Male

In [48]:
Data.drop('Age',axis=1) # By default (axis=0)

      Name    City  Gender
0  Anshika   Dewas  Female
1  Bhumika  Indore  Female
2    Sumit   Dewas    Male
3   Adeesh  Indore    Male
4  Bhavesh  Indore    Male

In [ ]:
Data # The data is unchanged

      Name  Age    City  Gender
0  Anshika   18   Dewas  Female
1  Bhumika   18  Indore  Female
2    Sumit   20   Dewas    Male
3   Adeesh   18  Indore    Male
4  Bhavesh   19  Indore    Male

In [50]:
## To make permanent changes we use (inplace = True)
Data.drop('Age',axis=1,inplace=True)

In [51]:
Data

      Name    City  Gender
0  Anshika   Dewas  Female
1  Bhumika  Indore  Female
2    Sumit   Dewas    Male
3   Adeesh  Indore    Male
4  Bhavesh  Indore    Male

In [53]:
## Add age to the coloumn
Data['Age'] = [18,19,20,21,22]

In [54]:
Data

      Name    City  Gender  Age
0  Anshika   Dewas  Female   18
1  Bhumika  Indore  Female   19
2    Sumit   Dewas    Male   20
3   Adeesh  Indore    Male   21
4  Bhavesh  Indore    Male   22

In [55]:
Data["Age"] = Data["Age"]+1
Data

      Name    City  Gender  Age
0  Anshika   Dewas  Female   19
1  Bhumika  Indore  Female   20
2    Sumit   Dewas    Male   21
3   Adeesh  Indore    Male   22
4  Bhavesh  Indore    Male   23

In [59]:
Data.describe()

             Age
count   5.000000
mean   21.000000
std     1.581139
min    19.000000
25%    20.000000
50%    21.000000
75%    22.000000
max    23.000000